[Illidan_necro.A_RangedAttack_Prime_Projectile H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="远程攻击"
mTooltip="远程攻击"

[Illidan_necro.A_Rebirth_Mort H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="死亡之友"
mTooltip="此生物有 20% 的几率在其队伍被摧毁时复活 100% 的原始队伍。"

[Illidan_necro.A_Rebirth_Firebird_Buff H7BaseBuff]
mName=""
mTooltip=""

[Illidan_necro.A_Creature_Seigneur_tenebre H7Creature]
mName="尸妖"
mLore="第三次月蚀后不久开始的对抗虚空秩序的大战，几乎导致艾尔拉思死亡，并动摇了人们对光明的信仰。即使是他的初生子也不例外，因为许多次级天使看到他们的龙神受苦而陷入绝望，离开了利希特费尔斯。被虚空玷污后，只有少数天使能够抵抗其诱惑并保持对创造者的忠诚。后来，应艾尔拉思的要求，他选中的英雄们找到了这些天使，但它们的灵魂再也无法回归光明。为了能再为正义服务一段时间，他们自愿选择了黑暗之路，饮用了混合了卡斯帕一种药水的神圣蜘蛛毒液。如今，他们失去了肉体，拥有乌黑的翅膀，被称为寂静仲裁者，纳-赫雷什可怕的最高法官。他们对罪犯和埃特纳家族敌人的判决严厉但公正，因为在死亡面前人人平等。\n\n招募所需稀有资源：\n5 龙血水晶"

[Illidan_necro.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="腐朽打击"
mTooltip="对 3x3 区域内的所有敌方生物造成 %d.min 到 %d.max %ICON_DARK 黑暗伤害，每场战斗一次。"

[Vampire_Originel.A_Creature_NECROPOLE8ORIGINAL8VAMPIRE H7Creature]
mName="吸血鬼亲王"
mLore="吸血鬼伯爵如果在战斗中表现出色，并探索了亚莎循环中非生命体的秘密路径，就可以晋升为亲王。因此，他们获得了新的黑暗力量。他们能够完全控制自己年轻但无生命的身体，并且不再像普通吸血鬼那样需要大量饮血，因为他们使用纳姆塔鲁毒液来施展强大的黑暗、非物质化和催眠法术。"

[Vampire_Originel.A_LifeDrain H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="饮血者"
mTooltip="该生物的命中会恢复其生命值，数值相当于对标记有新鲜血液的生物造成的伤害量。这也会复活倒下的生物。"

[Vampire_Originel.A_MightyPounce H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗杀"
mTooltip="每场战斗一次，该生物移动到战场上的任何敌方生物处，并进行一次强力攻击，造成 %d.min 到 %d.max %ICON_DARK 黑暗伤害。"

[Illidan_necro.A_Zombification_Buff H7BaseBuff]
mName="僵尸化"
mTooltip="此生物获得亡灵能力，持续 %durnow 回合。"

[Illidan_necro.A_frappe_putride H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="僵尸化"
mTooltip="被此生物攻击命中的敌方生物将获得亡灵能力，持续 %buff.buff.durini 回合。"

v1.38

[Vampire_Originel.A_AuraOfPestilence H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="新鲜血液"
mTooltip="吸血鬼亲王在其回合开始时接触到的生物被标记为“新鲜血液”。这使得吸血鬼亲王可以将其 50% 的伤害转化为自己的 %icon_health 生命值。它们还在每回合开始时受到 %d.min 到 %d.max %ICON_DARK 黑暗伤害。"

[Vampire_Originel.A_AuraOfPestilence_Buff_Damage H7BaseBuff]
mName="新鲜血液"
mTooltip="此生物被吸血鬼亲王标记。吸血鬼亲王对此生物的攻击会根据造成的伤害量治疗他自己。此外，此生物在其回合开始时受到黑暗伤害。"